app/controllers/users_controller.rb

INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "email") VALUES('Rails Tutorial', 'a0532ea395e6bf37252f50d5088749744ba389664a1d66640c77bf981a427c23', '51f03bae69a6d631c9bdac0369e48f9ac20aae2e76cfdc6ba842fa5b4e848b61', '2010-06-15 19:51:13', '2010-06-15 19:51:13', 'rails@example.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save